*Contents*
===
- [Kaggle and *nyc-rolling-sales*](#Kaggle-and-nyc-rolling-sales)
- [Pandas](#Pandas)
    - [*Series*, access, slicing, deletion](#Series,-access,-slicing,-deletion)  
    - [*One-hot* encoding](#One-hot-encoding)
    - [Exercise 1](#Exercise-1)
    - [Some more Pandas construction](#Some-more-Pandas-construction)
        - [Creating new columns](#Creating-new-columns)
        - [*groupby*](#groupby)
        - [Going deeper](#Going-deeper)

Kaggle and *nyc-rolling-sales*
===

So far we have:

- generated our data
- loaded them through Scikit-learn.

In both cases, data are already numeric and ready for training a machine learning model. More realistically, a dataset contains data of mixed type: think of a .csv or an Excel file.

In this lesson we will use a dataset from *Kaggle*. Kaggle is a website hosting machine learning challenges, as well as a data science hub and a nice place for practicing your skills: there you can find several [datasets](https://www.kaggle.com/datasets) and tons of notebooks like this (called *kernels*) with practical examples.

The *nyc-rolling-sales* dataset contains information from all of the estates sold in New York between 2016/9 and 2017/9. [This](https://www.kaggle.com/new-york-city/nyc-property-sales) is the original dataset, while in this notebook we will use a simplified version.

Pandas
===

*Pandas* is the Python library for visualizing and manipulating raw data. To go deeper you can have a look at the [official website](https://pandas.pydata.org/docs/getting_started/index.html). You can also follow [this getting started guide](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html).

In this lesson we will use Pandas to prepare the nyc-rolling-sales dataset so that it can be used for learning a machine learning model with Scikit-learn's models and tools.

In [1]:
import pandas as pd

pd.__version__

'1.1.3'

We start by loading the data using the *read_csv* function. Again, if you want to know more about this function without leaving Jupyter, you can click on the function name and press Shift - Tab (- Tab) to invoke the offline documentation.

In [2]:
df = pd.read_csv('../data/nyc_rolling_sales.csv')

We have created a Pandas *DataFrame*. The *head* function shows us the first (5, by default) rows of our dataset.

In [5]:
df.head()

,BOROUGH,NEIGHBORHOOD,BUILDING CLASS CATEGORY,TAX CLASS AT PRESENT,BLOCK,LOT,BUILDING CLASS AT PRESENT,ADDRESS,ZIP CODE,RESIDENTIAL UNITS,COMMERCIAL UNITS,LAND SQUARE FEET,GROSS SQUARE FEET,YEAR BUILT,TAX CLASS AT TIME OF SALE,BUILDING CLASS AT TIME OF SALE,SALE DATE,SALE PRICE
0,MANHATTAN,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,C2,153 AVENUE B,10009,5,0,1633,6440,1900,2,C2,2017-07-19 00:00:00,6625000
1,MANHATTAN,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,402,21,C4,154 EAST 7TH STREET,10009,10,0,2272,6794,1913,2,C4,2016-09-23 00:00:00,3936272
2,MANHATTAN,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,404,55,C2,301 EAST 10TH STREET,10009,6,0,2369,4615,1900,2,C2,2016-11-17 00:00:00,8000000
3,MANHATTAN,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,406,32,C4,210 AVENUE B,10009,8,0,1750,4226,1920,2,C4,2016-09-23 00:00:00,3192840
4,MANHATTAN,ALPHABET CITY,08 RENTALS - ELEVATOR APARTMENTS,2,387,153,D9,629 EAST 5TH STREET,10009,24,0,4489,18523,1920,2,D9,2016-11-07 00:00:00,16232000

*Series*, access, slicing, deletion
---

A Pandas DataFrame inherits the properties of NumPy arrays.

In [6]:
df.shape

(29280, 18)

As compared to a NumPy array, Pandas provides data with semantic (columns, that is, features, have a name) and an indexing structure.

In [7]:
df.columns

Index(['BOROUGH', 'NEIGHBORHOOD', 'BUILDING CLASS CATEGORY',
       'TAX CLASS AT PRESENT', 'BLOCK', 'LOT', 'BUILDING CLASS AT PRESENT',
       'ADDRESS', 'ZIP CODE', 'RESIDENTIAL UNITS', 'COMMERCIAL UNITS',
       'LAND SQUARE FEET', 'GROSS SQUARE FEET', 'YEAR BUILT',
       'TAX CLASS AT TIME OF SALE', 'BUILDING CLASS AT TIME OF SALE',
       'SALE DATE', 'SALE PRICE'],
      dtype='object')

In Pandas each column is called *Series*, and we can access its values through its name.

[Here](https://www1.nyc.gov/assets/finance/downloads/pdf/07pdf/glossary_rsf071607.pdf) you can find a nyc-rolling-sales dataset feature glossary.

In [8]:
df['NEIGHBORHOOD'].head(15)

0     ALPHABET CITY
1     ALPHABET CITY
2     ALPHABET CITY
3     ALPHABET CITY
4     ALPHABET CITY
5     ALPHABET CITY
6     ALPHABET CITY
7     ALPHABET CITY
8     ALPHABET CITY
9     ALPHABET CITY
10    ALPHABET CITY
11    ALPHABET CITY
12          CHELSEA
13          CHELSEA
14          CHELSEA
Name: NEIGHBORHOOD, dtype: object

In [9]:
df['BOROUGH'].describe()

count      29280
unique         5
top       QUEENS
freq       11068
Name: BOROUGH, dtype: object

In [10]:
df['BOROUGH'].value_counts()

QUEENS           11068
BROOKLYN          8662
STATEN ISLAND     5063
BRONX             3510
MANHATTAN          977
Name: BOROUGH, dtype: int64

You can use *iloc* (*integer location*) to access the records of a DataFrame as with NumPy arrays.

In [11]:
df.iloc[:3, 1:6]

,NEIGHBORHOOD,BUILDING CLASS CATEGORY,TAX CLASS AT PRESENT,BLOCK,LOT
0,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6
1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,402,21
2,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,404,55

You can extract a subset of columns with this syntax:

        df[col_list]

In [12]:
df[['NEIGHBORHOOD', 'SALE DATE', 'SALE PRICE']].head(3)

    NEIGHBORHOOD            SALE DATE  SALE PRICE
0  ALPHABET CITY  2017-07-19 00:00:00     6625000
1  ALPHABET CITY  2016-09-23 00:00:00     3936272
2  ALPHABET CITY  2016-11-17 00:00:00     8000000

Writing

        df[condition(df)]
        
we isolate the rows of a DataFrame meeting some boolean condition.

In [13]:
df[df['BOROUGH'] == 'BRONX'].shape

(3510, 18)

The dataset containts estates sold for less than 100$: they are donations. Let's count them and remove them from the dataset.

In [14]:
df['SALE PRICE'].min()

1

In [15]:
df[df['SALE PRICE'] < 100].shape

(671, 18)

In [16]:
df = df[df['SALE PRICE'] >= 100]

In [17]:
df['SALE PRICE'].min()

100

In [18]:
df.shape

(28609, 18)

The *drop* function allows to remove one or more columns from a DataFrame. For example, let's remove the *ZIP CODE* column.

In [19]:
df = df.drop(columns=['ZIP CODE'])

In [20]:
'ZIP CODE' in df.columns

False

*One-hot encoding*
---

We know that we can't just map the values of a categorical *nominal* feature (such as blood type, ethnicity) to integer numbers, so that to avoid creating spurious ordering relations between them.

With Pandas, we can *one-hot encode* a feature using the *get_dummies* function. Let's apply it on the BOROUGH column.

In [21]:
df['BOROUGH'].value_counts()

QUEENS           10845
BROOKLYN          8422
STATEN ISLAND     4969
BRONX             3434
MANHATTAN          939
Name: BOROUGH, dtype: int64

In [22]:
df = pd.get_dummies(df,
                    prefix=['BOR'],#a common prefix for the newly created columns
                    columns=['BOROUGH'])#list of columns to be encoded; here, just one

df.head()

,NEIGHBORHOOD,BUILDING CLASS CATEGORY,TAX CLASS AT PRESENT,BLOCK,LOT,BUILDING CLASS AT PRESENT,ADDRESS,RESIDENTIAL UNITS,COMMERCIAL UNITS,LAND SQUARE FEET,...,YEAR BUILT,TAX CLASS AT TIME OF SALE,BUILDING CLASS AT TIME OF SALE,SALE DATE,SALE PRICE,BOR_BRONX,BOR_BROOKLYN,BOR_MANHATTAN,BOR_QUEENS,BOR_STATEN ISLAND
0,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,C2,153 AVENUE B,5,0,1633,...,1900,2,C2,2017-07-19 00:00:00,6625000,0,0,1,0,0
1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,402,21,C4,154 EAST 7TH STREET,10,0,2272,...,1913,2,C4,2016-09-23 00:00:00,3936272,0,0,1,0,0
2,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,404,55,C2,301 EAST 10TH STREET,6,0,2369,...,1900,2,C2,2016-11-17 00:00:00,8000000,0,0,1,0,0
3,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,406,32,C4,210 AVENUE B,8,0,1750,...,1920,2,C4,2016-09-23 00:00:00,3192840,0,0,1,0,0
4,ALPHABET CITY,08 RENTALS - ELEVATOR APARTMENTS,2,387,153,D9,629 EAST 5TH STREET,24,0,4489,...,1920,2,D9,2016-11-07 00:00:00,16232000,0,0,1,0,0

The get_dummies function has transformed the BOROUGH column into as many (boolean) columns as its distinct values.

In [23]:
df.columns

Index(['NEIGHBORHOOD', 'BUILDING CLASS CATEGORY', 'TAX CLASS AT PRESENT',
       'BLOCK', 'LOT', 'BUILDING CLASS AT PRESENT', 'ADDRESS',
       'RESIDENTIAL UNITS', 'COMMERCIAL UNITS', 'LAND SQUARE FEET',
       'GROSS SQUARE FEET', 'YEAR BUILT', 'TAX CLASS AT TIME OF SALE',
       'BUILDING CLASS AT TIME OF SALE', 'SALE DATE', 'SALE PRICE',
       'BOR_BRONX', 'BOR_BROOKLYN', 'BOR_MANHATTAN', 'BOR_QUEENS',
       'BOR_STATEN ISLAND'],
      dtype='object')

Exercise 1
---

We want to predict the price of some of the estates of the nyc-rolling-sales dataset. Based on what we have learnt so far,

- prepare your data: encode the columns when needed, remove useless ones
- isolate the variable (column SALE PRICE) you want to predict
- train a suitable machine learning model on a set of training data
- choose a metric and evaluate the performance of your model on a test set.

Some more Pandas construction
---

Let's have a look at some other useful Pandas construction.

In [24]:
df = pd.read_csv('../data/nyc_rolling_sales.csv')
df.head()

,BOROUGH,NEIGHBORHOOD,BUILDING CLASS CATEGORY,TAX CLASS AT PRESENT,BLOCK,LOT,BUILDING CLASS AT PRESENT,ADDRESS,ZIP CODE,RESIDENTIAL UNITS,COMMERCIAL UNITS,LAND SQUARE FEET,GROSS SQUARE FEET,YEAR BUILT,TAX CLASS AT TIME OF SALE,BUILDING CLASS AT TIME OF SALE,SALE DATE,SALE PRICE
0,MANHATTAN,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,C2,153 AVENUE B,10009,5,0,1633,6440,1900,2,C2,2017-07-19 00:00:00,6625000
1,MANHATTAN,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,402,21,C4,154 EAST 7TH STREET,10009,10,0,2272,6794,1913,2,C4,2016-09-23 00:00:00,3936272
2,MANHATTAN,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,404,55,C2,301 EAST 10TH STREET,10009,6,0,2369,4615,1900,2,C2,2016-11-17 00:00:00,8000000
3,MANHATTAN,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,406,32,C4,210 AVENUE B,10009,8,0,1750,4226,1920,2,C4,2016-09-23 00:00:00,3192840
4,MANHATTAN,ALPHABET CITY,08 RENTALS - ELEVATOR APARTMENTS,2,387,153,D9,629 EAST 5TH STREET,10009,24,0,4489,18523,1920,2,D9,2016-11-07 00:00:00,16232000

### Creating new columns

In [25]:
df['TOTAL UNITS'] = df['RESIDENTIAL UNITS'] + df['COMMERCIAL UNITS']

In [26]:
df[['RESIDENTIAL UNITS', 'COMMERCIAL UNITS', 'TOTAL UNITS']].head(10)

   RESIDENTIAL UNITS  COMMERCIAL UNITS  TOTAL UNITS
0                  5                 0            5
1                 10                 0           10
2                  6                 0            6
3                  8                 0            8
4                 24                 0           24
5                 10                 0           10
6                 24                 0           24
7                 47                 0           47
8                  3                 1            4
9                  4                 1            5

*BLOCK*+*LOT* is a unique identifier. Let's create an *ID* column from the two.

In [27]:
df['BLOCK'][0]

392

In [28]:
df['BLOCK'] = df['BLOCK'].astype(str)
df['LOT'] = df['LOT'].astype(str)

In [29]:
df['BLOCK'][0]

'392'

In [30]:
df['ID'] = df['BLOCK'] + '-' + df['LOT']

df[['BLOCK', 'LOT', 'ID']].head()

  BLOCK  LOT       ID
0   392    6    392-6
1   402   21   402-21
2   404   55   404-55
3   406   32   406-32
4   387  153  387-153

### *groupby*

Pandas *groupby* is a powerful tool for aggregating data and computing group-specific statistics.

In [31]:
df.groupby(['BOROUGH'])['SALE PRICE'].median()

BOROUGH
BRONX             480000
BROOKLYN          850000
MANHATTAN        5750000
QUEENS            635000
STATEN ISLAND     485000
Name: SALE PRICE, dtype: int64

The function applies the same operation (in this case, *median*) to all of the groups it has created; in the above example:

- estates are grouped based on their *BOROUGH*
- their *SALE PRICE* is extracted, creating as many price vectors as the *BOROUGH*s in New York.
- from each group, the median value of each group (hence, of each price vector) is computed.

Here are some other examples.

In [32]:
df.groupby(['BOROUGH'])['SALE PRICE'].max()

BOROUGH
BRONX            86375000
BROOKLYN         98463962
MANHATTAN        93550000
QUEENS           85091472
STATEN ISLAND    11900000
Name: SALE PRICE, dtype: int64

In [33]:
df.groupby(['BOROUGH', 'TAX CLASS AT TIME OF SALE'])['SALE PRICE'].max()

BOROUGH        TAX CLASS AT TIME OF SALE
BRONX          1                            12303058
               2                            78137536
               4                            86375000
BROOKLYN       1                            13600000
               2                            68875000
               4                            98463962
MANHATTAN      1                            43500000
               2                            86500000
               4                            93550000
QUEENS         1                             6800000
               2                            85091472
               4                            78000000
STATEN ISLAND  1                            11900000
               2                             3700000
               4                            11700000
Name: SALE PRICE, dtype: int64

### Going deeper
To know more, have a look at
- [these lectures on time series analysis with Python](https://nbviewer.jupyter.org/github/fbagattini/Lezioni/tree/master/eng/)
- [the *Seaborn* library](https://seaborn.pydata.org/tutorial.html).

<script>
  $(document).ready(function(){
    $('div.back-to-top').hide();
    $('nav#menubar').hide();
    $('div.prompt').hide();
    $('.hidden-print').hide();
  });
</script>

<footer id="attribution" style="float:right; color:#999; background:#fff;">
Created with Jupyter, delivered by Fastly, rendered by Rackspace.
</footer>